#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-09d8ac12538411d38]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.cloudwatch_logs.aws_cloudwatch_log_group.logs: Refreshing state... [id=/machamp/staging/ecs]
module.ecs.module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-task-execution]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=staging]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::762742784206:policy/ecs-task-execution]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-09fd540a6c087b413]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0f47b5557a518ee32]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-04c459391a247e0ab]
module.ecs_service_sg.aws_security_group.sg: Refreshing state... [id=sg-0765e9b21f27b9a87]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-078207bd7321b1695]
module.network.aws_route_table.public: Refreshing state... [id=rtb-01aa3ece37c6487e0]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0320d2046da4cfbfb]
module.http_sg.aws_security_group.sg: Refreshing state... [id=sg-068c5d2fcd746ab57]
module.https_sg.aws_security_group.sg: Refreshing state... [id=sg-09157ae42a7ec22ca]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20210530141349119800000001]
module.ecs_service_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-133425637]
module.ecs_service_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2445190106]
module.network.aws_route.public: Refreshing state... [id=r-rtb-01aa3ece37c6487e01080289494]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1671588254]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4212506818]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-095bf430a13fe6780]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0399fe76182b6078f]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1073499807]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-993995983]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/8a1895f7f9c91409]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/0ae2b131cf2341a9]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/8a1895f7f9c91409/f1a4bee2a08032c5]
module.ecs.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_task_definition.taskdef must be replaced
-/+ resource "aws_ecs_task_definition" "taskdef" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:762742784206:task-definition/staging:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  + command          = [
                      + "bin/sh",
                      + "-ecs",
                      + <<-EOT
                            bundle exec rails db:create
                            bundle exec rails db:migrate
                            bundle exec rails server -b 0.0.0.0
                        EOT,
                    ]
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 80 -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
              + {
                  + command          = [
                      + "--default-authentication-plugin=mysql_native_password",
                    ]
                  + environment      = [
                      + {},
                    ]
                  + image            = "mysql:8.0.20"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/machamp/staging/ecs"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "db"
                        }
                    }
                  + name             = "db"
                },
            ]
        )
      ~ id                       = "staging" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>